# Groupby in Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "Name": ["Aman", "Saurav", "Karan", "Shubham","Abhishek",None, "Sameer"],
    "Age": [22, 23, None, 22, 25, 24, 26],
   "Marks": [85, None, 88, 90, 56, 72, None],
   "Subject": ["Math", "Physics", "Maths", "Chemistry", "Math", "Physics", "Chemistry"]
}
df = pd.DataFrame(data)
df

       Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
1    Saurav  23.0    NaN    Physics
2     Karan   NaN   88.0      Maths
3   Shubham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math
5      None  24.0   72.0    Physics
6    Sameer  26.0    NaN  Chemistry

##  basic group by

In [3]:
df.groupby("Subject")["Marks"].mean()   # mean marks per subject and it automatically ignor nan So missing marks will not break calculation.

Subject
Chemistry    90.0
Math         70.5
Maths        88.0
Physics      72.0
Name: Marks, dtype: float64

In [4]:
df.groupby("Subject")["Name"].count() # count student per subject ignoring missing value by default

Subject
Chemistry    2
Math         2
Maths        1
Physics      1
Name: Name, dtype: int64

In [5]:
df.groupby("Subject").size()  # this count with missing value also

Subject
Chemistry    2
Math         2
Maths        1
Physics      2
dtype: int64

In [6]:
# multiple agrregration with single column
df.groupby("Subject")["Marks"].agg(["mean","max","min","sum","count"])

           mean   max   min    sum  count
Subject
Chemistry  90.0  90.0  90.0   90.0      1
Math       70.5  85.0  56.0  141.0      2
Maths      88.0  88.0  88.0   88.0      1
Physics    72.0  72.0  72.0   72.0      1

In [8]:
#multiple agrregration by multiple column
df.groupby(["Subject","Age"])["Marks"].mean()

Subject    Age
Chemistry  22.0    90.0
           26.0     NaN
Math       22.0    85.0
           25.0    56.0
Physics    23.0     NaN
           24.0    72.0
Name: Marks, dtype: float64